In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({'A':[95,92,98,100],'B':[91,93,97,99]})

In [3]:
df2=pd.DataFrame({'A':[87,89],'B':[85,90]})

In [4]:
df1

     A   B
0   95  91
1   92  93
2   98  97
3  100  99

In [5]:
df2

    A   B
0  87  85
1  89  90

In [10]:
# 판다스
pd.merge(df1, df2, how='outer')

     A   B
0   87  85
1   89  90
2   92  93
3   95  91
4   98  97
5  100  99

In [11]:
df1

     A   B
0   95  91
1   92  93
2   98  97
3  100  99

In [12]:
df3=pd.DataFrame({'D':[100,100,100,100]})

In [13]:
df3

     D
0  100
1  100
2  100
3  100

In [ ]:
pd.concat([df1,df3])

       A     B      D
0   95.0  91.0    NaN
1   92.0  93.0    NaN
2   98.0  97.0    NaN
3  100.0  99.0    NaN
0    NaN   NaN  100.0
1    NaN   NaN  100.0
2    NaN   NaN  100.0
3    NaN   NaN  100.0

In [17]:
pd.concat([df1,df3], ignore_index=True)

       A     B      D
0   95.0  91.0    NaN
1   92.0  93.0    NaN
2   98.0  97.0    NaN
3  100.0  99.0    NaN
4    NaN   NaN  100.0
5    NaN   NaN  100.0
6    NaN   NaN  100.0
7    NaN   NaN  100.0

In [22]:
pd.concat([df1,df3],axis=1)

     A   B    D
0   95  91  100
1   92  93  100
2   98  97  100
3  100  99  100

In [37]:
df1=pd.DataFrame({'Name':['Harry Potter','David Baker','John Smith','Juan Martinez', 'Jane Connor'],
                  'Gender':['Male','Male','Male','Male', 'Female'],
                   'Age':[23,31,22,36,30]})

In [38]:
df1

            Name  Gender  Age
0   Harry Potter    Male   23
1    David Baker    Male   31
2     John Smith    Male   22
3  Juan Martinez    Male   36
4    Jane Connor  Female   30

In [39]:
df2=pd.DataFrame({'Name':['John Smith', 'Alex Du Bois','Joanne Rowling','Jane Connor'],
                  'Position':['Intern','Team Lead','Manager','Manager'],
                   'Wage':[25000,75000,90000,70000]})

In [40]:
df2

             Name   Position   Wage
0      John Smith     Intern  25000
1    Alex Du Bois  Team Lead  75000
2  Joanne Rowling    Manager  90000
3     Jane Connor    Manager  70000

In [41]:
df1.columns, df2.columns

(Index(['Name', 'Gender', 'Age'], dtype='object'),
 Index(['Name', 'Position', 'Wage'], dtype='object'))

In [ ]:
pd.merge(df1, df2, on='Name') #innerJoin

          Name  Gender  Age Position   Wage
0   John Smith    Male   22   Intern  25000
1  Jane Connor  Female   30  Manager  70000

In [44]:
pd.merge(df1, df2, on='Name', how='inner') #innerJoin

          Name  Gender  Age Position   Wage
0   John Smith    Male   22   Intern  25000
1  Jane Connor  Female   30  Manager  70000

In [45]:
pd.merge(df1, df2, on='Name', how='left')

            Name  Gender  Age Position     Wage
0   Harry Potter    Male   23      NaN      NaN
1    David Baker    Male   31      NaN      NaN
2     John Smith    Male   22   Intern  25000.0
3  Juan Martinez    Male   36      NaN      NaN
4    Jane Connor  Female   30  Manager  70000.0

In [46]:
pd.merge(df1, df2, on='Name', how='right')

             Name  Gender   Age   Position   Wage
0      John Smith    Male  22.0     Intern  25000
1    Alex Du Bois     NaN   NaN  Team Lead  75000
2  Joanne Rowling     NaN   NaN    Manager  90000
3     Jane Connor  Female  30.0    Manager  70000

In [47]:
pd.merge(df1, df2, on='Name', how='outer')

             Name  Gender   Age   Position     Wage
0    Alex Du Bois     NaN   NaN  Team Lead  75000.0
1     David Baker    Male  31.0        NaN      NaN
2    Harry Potter    Male  23.0        NaN      NaN
3     Jane Connor  Female  30.0    Manager  70000.0
4  Joanne Rowling     NaN   NaN    Manager  90000.0
5      John Smith    Male  22.0     Intern  25000.0
6   Juan Martinez    Male  36.0        NaN      NaN